<template><div><h1 id="性能保持" tabindex="-1"><a class="header-anchor" href="#性能保持"><span>性能保持</span></a></h1>
<p>网站性能优化一次是不够的，谷歌研究发现，40% 的网站在 6 个月后性能会出现倒退。</p>
<p>保持良好性能有以下 3 个方法：</p>
<ul>
<li>
<p>设定性能预算</p>
<p>性能预算是对影响网站性能的指标的一系列限制。类似于财务预算：设定一个限额，并确保不超出该限额。</p>
<p>将预算纳入构建流程，如果关键指标低于设定阈值，则构建失败。此外，通过 dashboard 进行定期报告有助于提高能见度和问责制。</p>
</li>
<li>
<p>开发性能监控</p>
<p>性能监控就是对网站各项指标进行监控，快速获知网站当前的性能状况，并在出现性能问题时发起告警。</p>
</li>
<li>
<p>建立性能文化</p>
<p>所谓性能文化就是通过展示性能对转化率、跳出率等业务指标的影响，提高相关方对性能的重视。</p>
</li>
</ul>
</div></template>


