<template><div><h1 id="回调" tabindex="-1"><a class="header-anchor" href="#回调"><span>回调</span></a></h1>
<p>回调函数是 JavaScript 异步的基本单元。但是随着 JavaScript 越来越成熟，对于异步编程领域的发展，回调已经不够用了。</p>
<ul>
<li>
<p>回调是非线性的</p>
<p>大脑对于事情的计划方式是线性的、阻塞的、单线程的语义，但是回调表达异步流程的方式是非线性的、非顺序的，这使得正确推导这样的代码难度很大。</p>
</li>
<li>
<p>回调因为控制反转会造成信任问题</p>
<p>回调会受到控制反转的影响，因为回调暗中把控制权交给第三方(通常是不受你控制的第三方工具)来调用你代码中的回调部分代码。这种控制转移导致一系列麻烦的信任问题，比如回调被调用的次数是否会超出预期。</p>
</li>
</ul>
<p>我们需要比回调更好的机制。到目前为止，回调提供了很好的服务，但是未来的 JavaScript 需要更高级、功能更强大的异步模式。</p>
</div></template>


